# ItemText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem..::..ItemText Property
RibbonItem Class See Also
---
Gets or sets the text displayed on the item.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual string ItemText { get; set; }
```

Visual Basic
---
```text
Public Overridable Property ItemText As String
	Get
	Set
```

Visual C++
---
```text
public:
virtual property String^ ItemText {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The text can be changed at run time. nullNothingnullptra null reference (Nothing in Visual Basic) or empty string is not allowed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting the text to empty or to the string contains "%". |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when setting the text to nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace